Revit 2027 API
ColumnAttachment.GetColumnAttachment(FamilyInstance, ElementId) Method
 Look up a column attachment by specifying the target id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ColumnAttachment GetColumnAttachment(
	FamilyInstance column,
	ElementId targetId
)
Public Shared Function GetColumnAttachment (
	column As FamilyInstance,
	targetId As ElementId
) As ColumnAttachment
public:
static ColumnAttachment^ GetColumnAttachment(
	FamilyInstance^ column,
	ElementId^ targetId
)
static member GetColumnAttachment :
        column : FamilyInstance *
        targetId : ElementId -> ColumnAttachment
Parameters
column FamilyInstance
 A column.
targetId ElementId
 Id of a target element.
Return Value
ColumnAttachment
 The column attachment attaching the column to the target, or null if there is no such attachment.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 May return either a top or base attachment.
See Also
Reference
ColumnAttachment Class
GetColumnAttachment Overload
Autodesk.Revit.DB Namespace